In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={"name":['rohan','seema','mahesh','shruti'],
       "marks":[90,55,67,98],
       "city":['delhi','jaipur','rampur','barilly']}

In [4]:
df=pd.DataFrame(dict1)

In [5]:
df

     name  marks     city
0   rohan     90    delhi
1   seema     55   jaipur
2  mahesh     67   rampur
3  shruti     98  barilly

In [7]:
df.index=[1,2,3,4]
df

     name  marks     city
1   rohan     90    delhi
2   seema     55   jaipur
3  mahesh     67   rampur
4  shruti     98  barilly

In [11]:
ser=pd.Series(np.random.rand(20))

In [12]:
ser

0     0.809681
1     0.498111
2     0.503549
3     0.707508
4     0.344958
5     0.469851
6     0.271414
7     0.119295
8     0.943090
9     0.000519
10    0.978334
11    0.234111
12    0.949676
13    0.709315
14    0.232616
15    0.498319
16    0.155566
17    0.583851
18    0.510605
19    0.293563
dtype: float64